blog/app/views/posts/show.html.erb

<p>----------------------------------------------------------------------------------------------------<p>
<% @post.comments.all.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3