app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3
---

<% @post.comments.all.each do |comment| %>