app/controllers/comments_controller.rb

	def create
		post = Post.find(params[:post_id])
		post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "writer") VALUES (?, ?, ?, ?, ?)  [["body", "thibault écrit dans le body"], ["created_at", Sat, 12 May 2012 13:15:07 UTC +00:00], ["post_id", 3], ["updated_at", Sat, 12 May 2012 13:15:07 UTC +00:00], ["writer", "thibault"]]