app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "lolilol"], ["created_at", Mon, 30 Apr 2012 12:32:49 UTC +00:00], ["title", "toto"], ["updated_at", Mon, 30 Apr 2012 12:32:49 UTC +00:00]]
---
	def create
		post = Post.create(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "title" = 'titre 1 modifie', "body" = 'blabla1 modifie aussi', "updated_at" = '2012-05-01 16:34:34.970109' WHERE "posts"."id" = 1
---
	def update
		@post = Post.find(params[:id])
		@post.update_attributes(params[:post])